package com.test.xrh.superweather.gson;

import com.google.gson.annotations.SerializedName;

import java.util.List;

/**
 * Created by admin on 2017/9/25.
 */


    /*{"HeWeather5":[{"aqi":{"city":{"aqi":"95","co":"1","no2":"49","o3":"55","pm10":"136","pm25":"71","qlty":"良","so2":"10"}},"basic":{"city":"北京","cnty":"中国","id":"CN101010100","lat":"39.90498734","lon":"116.40528870","update":{"loc":"2017-09-25 12:46","utc":"2017-09-25 04:46"}},"daily_forecast":[{"astro":{"mr":"10:44","ms":"21:15","sr":"06:05","ss":"18:07"},"cond":{"code_d":"104","code_n":"104","txt_d":"阴","txt_n":"阴"},"date":"2017-09-25","hum":"50","pcpn":"0.0","pop":"5","pres":"1012","tmp":{"max":"28","min":"19"},"uv":"6","vis":"20","wind":{"deg":"84","dir":"东风","sc":"微风","spd":"5"}},{"astro":{"mr":"11:40","ms":"21:54","sr":"06:06","ss":"18:06"},"cond":{"code_d":"305","code_n":"305","txt_d":"小雨","txt_n":"小雨"},"date":"2017-09-26","hum":"60","pcpn":"4.3","pop":"87","pres":"1014","tmp":{"max":"23","min":"14"},"uv":"3","vis":"18","wind":{"deg":"3","dir":"北风","sc":"微风","spd":"12"}},{"astro":{"mr":"12:33","ms":"22:36","sr":"06:07","ss":"18:04"},"cond":{"code_d":"101","code_n":"101","txt_d":"多云","txt_n":"多云"},"date":"2017-09-27","hum":"36","pcpn":"0.0","pop":"0","pres":"1016","tmp":{"max":"23","min":"13"},"uv":"6","vis":"20","wind":{"deg":"107","dir":"东南风","sc":"微风","spd":"11"}}],"hourly_forecast":[{"cond":{"code":"103","txt":"晴间多云"},"date":"2017-09-25 13:00","hum":"59","pop":"0","pres":"1011","tmp":"25","wind":{"deg":"170","dir":"南风","sc":"微风","spd":"11"}},{"cond":{"code":"100","txt":"晴"},"date":"2017-09-25 16:00","hum":"57","pop":"0","pres":"1009","tmp":"26","wind":{"deg":"173","dir":"南风","sc":"微风","spd":"13"}},{"cond":{"code":"100","txt":"晴"},"date":"2017-09-25 19:00","hum":"73","pop":"0","pres":"1009","tmp":"22","wind":{"deg":"168","dir":"东南风","sc":"微风","spd":"11"}},{"cond":{"code":"103","txt":"晴间多云"},"date":"2017-09-25 22:00","hum":"87","pop":"3","pres":"1010","tmp":"21","wind":{"deg":"193","dir":"西南风","sc":"微风","spd":"9"}}],"now":{"cond":{"code":"104","txt":"阴"},"fl":"26","hum":"63","pcpn":"0","pres":"1012","tmp":"26","vis":"7","wind":{"deg":"113","dir":"东南风","sc":"微风","spd":"8"}},"status":"ok","suggestion":{"air":{"brf":"中","txt":"气象条件对空气污染物稀释、扩散和清除无明显影响，易感人群应适当减少室外活动时间。"},"comf":{"brf":"较舒适","txt":"白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。"},"cw":{"brf":"较适宜","txt":"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。"},"drsg":{"brf":"热","txt":"天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。"},"flu":{"brf":"少发","txt":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"sport":{"brf":"较不宜","txt":"阴天，且天气较热，请减少运动时间并降低运动强度。"},"trav":{"brf":"适宜","txt":"天气较好，温度适宜，总体来说还是好天气哦，这样的天气适宜旅游，您可以尽情地享受大自然的风光。"},"uv":{"brf":"弱","txt":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"}}}]}*/


    public  class Weather {
        /**
         * aqi : {"city":{"aqi":"95","co":"1","no2":"49","o3":"55","pm10":"136","pm25":"71","qlty":"良","so2":"10"}}
         * basic : {"city":"北京","cnty":"中国","id":"CN101010100","lat":"39.90498734","lon":"116.40528870","update":{"loc":"2017-09-25 12:46","utc":"2017-09-25 04:46"}}
         * daily_forecast : [{"astro":{"mr":"10:44","ms":"21:15","sr":"06:05","ss":"18:07"},"cond":{"code_d":"104","code_n":"104","txt_d":"阴","txt_n":"阴"},"date":"2017-09-25","hum":"50","pcpn":"0.0","pop":"5","pres":"1012","tmp":{"max":"28","min":"19"},"uv":"6","vis":"20","wind":{"deg":"84","dir":"东风","sc":"微风","spd":"5"}},{"astro":{"mr":"11:40","ms":"21:54","sr":"06:06","ss":"18:06"},"cond":{"code_d":"305","code_n":"305","txt_d":"小雨","txt_n":"小雨"},"date":"2017-09-26","hum":"60","pcpn":"4.3","pop":"87","pres":"1014","tmp":{"max":"23","min":"14"},"uv":"3","vis":"18","wind":{"deg":"3","dir":"北风","sc":"微风","spd":"12"}},{"astro":{"mr":"12:33","ms":"22:36","sr":"06:07","ss":"18:04"},"cond":{"code_d":"101","code_n":"101","txt_d":"多云","txt_n":"多云"},"date":"2017-09-27","hum":"36","pcpn":"0.0","pop":"0","pres":"1016","tmp":{"max":"23","min":"13"},"uv":"6","vis":"20","wind":{"deg":"107","dir":"东南风","sc":"微风","spd":"11"}}]
         * hourly_forecast : [{"cond":{"code":"103","txt":"晴间多云"},"date":"2017-09-25 13:00","hum":"59","pop":"0","pres":"1011","tmp":"25","wind":{"deg":"170","dir":"南风","sc":"微风","spd":"11"}},{"cond":{"code":"100","txt":"晴"},"date":"2017-09-25 16:00","hum":"57","pop":"0","pres":"1009","tmp":"26","wind":{"deg":"173","dir":"南风","sc":"微风","spd":"13"}},{"cond":{"code":"100","txt":"晴"},"date":"2017-09-25 19:00","hum":"73","pop":"0","pres":"1009","tmp":"22","wind":{"deg":"168","dir":"东南风","sc":"微风","spd":"11"}},{"cond":{"code":"103","txt":"晴间多云"},"date":"2017-09-25 22:00","hum":"87","pop":"3","pres":"1010","tmp":"21","wind":{"deg":"193","dir":"西南风","sc":"微风","spd":"9"}}]
         * now : {"cond":{"code":"104","txt":"阴"},"fl":"26","hum":"63","pcpn":"0","pres":"1012","tmp":"26","vis":"7","wind":{"deg":"113","dir":"东南风","sc":"微风","spd":"8"}}
         * status : ok
         * suggestion : {"air":{"brf":"中","txt":"气象条件对空气污染物稀释、扩散和清除无明显影响，易感人群应适当减少室外活动时间。"},"comf":{"brf":"较舒适","txt":"白天天气晴好，您在这种天气条件下，会感觉早晚凉爽、舒适，午后偏热。"},"cw":{"brf":"较适宜","txt":"较适宜洗车，未来一天无雨，风力较小，擦洗一新的汽车至少能保持一天。"},"drsg":{"brf":"热","txt":"天气热，建议着短裙、短裤、短薄外套、T恤等夏季服装。"},"flu":{"brf":"少发","txt":"各项气象条件适宜，无明显降温过程，发生感冒机率较低。"},"sport":{"brf":"较不宜","txt":"阴天，且天气较热，请减少运动时间并降低运动强度。"},"trav":{"brf":"适宜","txt":"天气较好，温度适宜，总体来说还是好天气哦，这样的天气适宜旅游，您可以尽情地享受大自然的风光。"},"uv":{"brf":"弱","txt":"紫外线强度较弱，建议出门前涂擦SPF在12-15之间、PA+的防晒护肤品。"}}
         */

        public AqiBean aqi;
        public BasicBean basic;
        public NowBean now;
        public String status;
        public SuggestionBean suggestion;
        @SerializedName("daily_forecast")
        public List<DailyForecastBean> daily_forecast;


    }


